Repository: victorlevasseur/GD-Array-Extension
Catalog: translations/Array.po
Languages: fr_fr

source: Set a value
fr_fr: Affecter une valeur

source: Set a value as a number at a specific index.
fr_fr: Affecter une valeur (un nombre) à un indice.

source: Do _PARAM4__PARAM5_ to the value of _PARAM0_[_PARAM1_;_PARAM2_;_PARAM3_]
fr_fr: Faire _PARAM4__PARAM5_ à la valeur de _PARAM0_[_PARAM1_;_PARAM2_;_PARAM3_]

source: 3D Array
fr_fr: Tableau 3D

source: Array Name
fr_fr: Nom du tableau

source: X index
fr_fr: Indice sur X

source: Y index
fr_fr: Indice sur Y

source: Z index
fr_fr: Indice sur Z

source: Modification's sign
fr_fr: Signe de modification

source: Value
fr_fr: Valeur

source: Value at an index
fr_fr: Valeur à un indice

source: Test the value (as number) at a specific index.
fr_fr: Tester la valeur (nombre) stockée à un indice.

source: The value of _PARAM0_[_PARAM1_;_PARAM2_;_PARAM3_] is _PARAM4__PARAM5_
fr_fr: La valeur de _PARAM0_[_PARAM1_;_PARAM2_;_PARAM3_] est _PARAM4__PARAM5_

source: Comparison's sign
fr_fr: Signe de comparaison

source: Set a text
fr_fr: Affecter un texte

source: Set a text at a specific index.
fr_fr: Affecter un texte à un indice.

source: Do _PARAM4__PARAM5_ to the text of _PARAM0_[_PARAM1_;_PARAM2_;_PARAM3_]
fr_fr: Faire _PARAM4__PARAM5_ au texte de _PARAM0_[_PARAM1_;_PARAM2_;_PARAM3_]

source: Text
fr_fr: Texte

source: Text at an index
fr_fr: Texte à un indice

source: Test the text at a specific index.
fr_fr: Tester le texte stocké à un indice

source: The text of _PARAM0_[_PARAM1_;_PARAM2_;_PARAM3_] is _PARAM4__PARAM5_
fr_fr: La valeur de _PARAM0_[_PARAM1_;_PARAM2_;_PARAM3_] est _PARAM4__PARAM5_

source: Insert a value
fr_fr: Insérer une valeur

source: Insert a value (number) at a specific index.
fr_fr: Insérer une valeur (nombre) à un indice.

source: Insert _PARAM3_ at the index _PARAM2_ on the axis _PARAM1_ of _PARAM0_
fr_fr: Insérer _PARAM3_ à l'indice _PARAM2_ sur l'axe _PARAM1_ de _PARAM0_

source: Axis ("X", "Y" or "Z")
fr_fr: Axe ("X", "Y" ou "Z")

source: Index in that axis
fr_fr: Indice sur cette axe

source: Insert a text
fr_fr: Insérer un texte

source: Insert a text at a specific index.
fr_fr: Affecter un texte à un indice.

source: Remove an index
fr_fr: Enlever un indice

source: Remove an index from the array.
fr_fr: Enlever un indice d'un tableau.

source: Remove the index _PARAM2_ on the axis _PARAM1_ of _PARAM0_
fr_fr: Insérer _PARAM3_ à l'indice _PARAM2_ sur l'axe _PARAM1_ de _PARAM0_

source: Set size
fr_fr: Définir la taille

source: Set the size of an array. This action is needed to create the array, otherwise the array is empty (size of 0 on X, Y and Z).
fr_fr: Définir la taille d'un tableau. Cette action est indispensable pour créer un tableau, sinon le tableau est vide (taille de 0 sur X, Y et Z).

source: Set the size of _PARAM0_ to _PARAM1_;_PARAM2_;_PARAM3_
fr_fr: Définir la taille de _PARAM0_ à _PARAM1_;_PARAM2_;_PARAM3_

source: Width (size on X)
fr_fr: Largeur (taille sur X)

source: Height (size on Y)
fr_fr: Hauteur (taille sur Y)

source: Depth (size on Z)
fr_fr: Profondeur (taille sur Z)

source: Width of an array
fr_fr: Largeur d'un tableau

source: Height of an array
fr_fr: Hauteur d'un tableau

source: Depth of an array
fr_fr: Profondeur d'un tableau

source: Iterate in a 3D Array
fr_fr: Parcourir un tableau 3D

source: Execute the event for each values contained in a 3D Array. You can access the value and its index by using dedicated expressions
fr_fr: Exécute l'événement pour chaque valeur contenue dans le tableau 3D. Il est possible d'accéder à la valeur et à l'indice courant en utilisant des expressions dédiées

source: Current X position in array
fr_fr: Indice actuel sur X

source: Return the current X position in the array (when you use the "iterate through 3D array" event)
fr_fr: Renvoi l'indice actuel sur X (parcouru par l'événement "Parcourir un tableau 3D")

source: Current Y position in array
fr_fr: Indice actuel sur Y

source: Return the current Y position in the array (when you use the "iterate through 3D array" event)
fr_fr: Renvoi l'indice actuel sur Y (parcouru par l'événement "Parcourir un tableau 3D")

source: Current Z position in array
fr_fr: Indice actuel sur Z

source: Return the current Z position in the array (when you use the "iterate through 3D array" event)
fr_fr: Renvoi l'indice actuel sur Z (parcouru par l'événement "Parcourir un tableau 3D")

source: Current value in array
fr_fr: Valeur actuelle

source: Return the current value in the array (when you use the "iterate through 3D array" event)
fr_fr: Renvoi la valeur actuelle (parcourue par l'événement "Parcourir un tableau 3D")

source: Current text in array
fr_fr: Texte actuel

source: Return the current text in the array (when you use the "iterate through 3D array" event)
fr_fr: Renvoi la texte actuel (parcouru par l'événement "Parcourir un tableau 3D")

source: Iterate through
fr_fr: Parcourir le tableau

source: (Not defined)
fr_fr: (Non défini)

source: on XYZ
fr_fr: sur XYZ

source: Edit "Iterate through an array" event
fr_fr: Editer l'événement "Parcourir un tableau"

source: Array's name :
fr_fr: Nom du tableau :

source: Cancel
fr_fr: Annuler

source: Array
fr_fr: Tableau

source: Extension to store values and text inside arrays.
fr_fr: Extension pour stocker des valeurs et textes dans des tableaux

source: Initialize
fr_fr: Initialiser

source: Initialize the scene's arrays. This action need to be executed at the beginning of the scene before any actions related to the arrays.
fr_fr: Initialise l'extension Tableau. Cette action doit être exécutée au lancement de la scène avant toutes les actions liées aux tableaux.

source: Initialize arrays
fr_fr: Initialiser les tableaux
